periods_pattern_name = {
    "supplement_73": "^\s*дополнение\s*73\s*$",
    "supplement_72": "^\s*дополнение\s*72\s*$",
    "supplement_71": "^\s*дополнение\s*71\s*$",
    "supplement_70": "^\s*дополнение\s*70\s*$",
    "supplement_69": "^\s*дополнение\s*69\s*$",
    #
    "index_common": "^\s*\d+\s*индекс/дополнение\s*\d+\s*\(.+\)\s*$",
}

ton_periods = {
    "Индекс 211": ("index", 167403321, "211 индекс/дополнение 72 (мониторинг 2 кв 2024)"),
    "Индекс Май": ("index", 167597127, "Индекс Май 2024/Дополнение 72 (мониторинг Апрель)"),
    "Индекс Июнь": ("index", 167713480, "Индекс Июнь 2024/Дополнение 72 (мониторинг Май)"),
}    

monitoring_period_names = {
    "Февраль 2024": (167177895, "Мониторинг Февраль 2024 (209 сборник/дополнение 71)"),
    "Апрель 2024": (167461475, "Мониторинг Апрель 2024 (211 сборник/дополнение 72)"),
    "Март 2024": (167319938, "Мониторинг Март 2024 (210 сборник/дополнение 71)"),
    "Май 2024": (None, "Мониторинг Май 2024 (212 сборник/дополнение 72)"), 
    "Июнь 2024": (None, None), 
    "Июль 2024": (None, None), 
    "Август 2024": (None, None), 
    "Сентябрь 2024": (None, None), 
    "Октябрь 2024": (None, None), 
    "Ноябрь 2024": (None, None), 
    "Декабрь 2024": (None, None),
}



if __name__ == "__main__":
    print(periods_pattern_name)
